{
    "cards": [
        {
            "title": "Promotion of Active Learning",
            "content": "The main goal was to establish an interactive platform that enables individuals to immerse themselves in a journey of active learning, driven by hands-on exercises.",
            "image":"icono1.svg"
        },
        {
            "title": "Supporting Fellow Learners",
            "content":"The core purpose was to offer a valuable hub for all those seeking effective, self-directed education, providing guidance and resources to diverse learners.",
            "image":"icon2.svg"
        },
        {
            "title": "Hands-On Coding",
            "content": "Experience Lightning Network by typing and executing actual code with syntax highlighting",
            "image":"icono3.svg"
         
        },
        {
            "title": "Engaging Experience",
            "content": "Our passion lies in creating an immersive, understandable learning journey.",
            "image":"icono4.svg"
        
        },
        {
            "title": "Igniting Curiosity",
            "content": " By granting free access and content suitable for learners of varying proficiency levels, the ambition was to ignite curiosity and enthusiasm for continuous learning.",
            "image":"icono5.svg"
        
        }

    ],
    "list":[

        {
            "title": "A Spectrum of Cool Subjects",
            "content": "Through our \"type and execute code yourself\" approach, you'll immerse yourself in practical and interactive learning. Engage with real-time exercises for a deeper understanding."
            
        },
        {
            "title": "Hands-On Experience",
            "content":"LightningLearn offers a complete learning immersion. Engage in tasks, challenges, lessons, and quizzes that refine your Lightning Network skill"
        },
        {
            "title": "Real-time Practice Access",
            "content": "We offer the opportunity to work on real-time exercises and simulations. This allows you to directly apply your knowledge and experience Lightning Network in a secure environment."
            
         
        }


    ],
    "resources":[

        {
            "title": "The Bitcoin Lightning Network:\n Scalable Off-Chain Instant Payments",
            "content": "https://lightning.network/lightning-network-paper.pdf"
            
            
        },
        {
            "title": "What is Linux?",
            "content": "https://www.linux.com/what-is-linux/"
            
            
        }


    ],
    "generalContent": {
        "title": "ZapZone Learning",
        "btn-start": "START",
        "question": "Why ZapZone Learning?"
    },
    "implementations": [
        {
            "title": "Core Lightning (previously c-lightning) ",
            "content": "is a lightweight, highly customizable and standard compliant implementation of the Lightning Network protocol.",
            "link": "https://github.com/lightningnetwork/lnd",
            "linkroute":"/deploy/cln"
            
        },
        {
            "title": "Eclair",
            "content": "Eclair (French for Lightning) is a Scala implementation of the Lightning Network.",
            "link": "https://github.com/ACINQ/eclair#installing-eclair",
            "linkroute":"/deploy/eclair"
        },
        

        {
            "title": "The Lightning Network Daemon",
            "content": "is a complete implementation of a Lightning Network node. lnd has several pluggable back-end chain services including btcd (a full-node), bitcoind, and neutrino (a new experimental light client)",
            "link": "https://github.com/ElementsProject/lightning",
            "linkroute":"/deploy/lnd"
        }
    ],

    "steps": {
        "Step 1": "Run the following command to clear the terminal:\nclear",
        "Step 2": "Install the snapd package using the following command:\nsudo apt-get install snapd -y",
        "Step 3": "Install the bitcoin-core client using snap:\nsudo snap install bitcoin-core",
        "Step 4": "Create a symbolic link to access Bitcoin Core binaries:\nsudo ln -s /snap/bitcoin-core/current/bin/bitcoin{d,-cli} /usr/local/bin/",
        "Step 5": "Clone the Lightning Network repository from GitHub:\ngit clone https://github.com/ElementsProject/lightning.git",
        "Step 6": "Update the system and then install necessary packages for compilation:\n sudo apt-get update sudo apt-get install -y autoconf automake build-essential git libtool libsqlite3-dev python3 python3-pip net-tools zlib1g-dev libsodium-dev gettext pip3 install --upgrade pip pip3 install --user poetry",
        "Step 8": "Configure and compile the Lightning Network source code:\n. /configure --enable-developer && make -j7 && make install",
        "Step 9": "Create a directory to store Bitcoin data:\nmkdir ~/.bitcoin",
        "Step 10": "Run the script to start a Bitcoin regtest network:\n. contrib/startup_regtest.sh",
        "Step 11": "Start the Lightning Network daemon with 2 nodes:\nstart_ln 2",
        "Step 12": "Generate 10 blocks in the Bitcoin regtest blockchain:\nbt-cli generatetoaddress 10 $(bt-cli getnewaddress)",
        "Step 13": "Get the balances of Bitcoin addresses:\nbt-cli getbalances",
        "Step 14": "Get information about the Lightning Network node:\nl2-cli getinfo",
        "Step 15": "Connect to the first Lightning Network node:\nl1-cli connect 027530d124566d735277cf74dd030b7ef6fba8f671e67ecd48075827989d977600@127.0.0.1:7272",
        "Step 16": "List the connected peers of the first node:\nl1-cli listpeers"
      }
    
}